10/data/attachments/e896b3aa3da63873.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_47580c54-8541-4191-83be-e518dcba4b04</nif:username>
            <nif:friendToBeAdded>Danielle_until_Friend_18772_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>